una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4350_m4.h
/* Edge configuration register */
typedef struct {
  __REG32  WAKEUP0_E      : 1;
  __REG32  WAKEUP1_E      : 1;
  __REG32  WAKEUP2_E      : 1;
  __REG32  WAKEUP3_E      : 1;
  __REG32  ATIMER_E       : 1;
  __REG32  RTC_E          : 1;
  __REG32  BOD_E          : 1;
  __REG32  WWDT_E         : 1;
  __REG32  ETH_E          : 1;
  __REG32  USB0_E         : 1;
  __REG32  USB1_E         : 1;
  __REG32  SDMMC_E        : 1;
  __REG32  CAN_E          : 1;
  __REG32  TIM2_E         : 1;
  __REG32  TIM6_E         : 1;
  __REG32  QEI_E          : 1;
  __REG32  TIM14_E        : 1;
  __REG32                 : 2;
  __REG32  RESET_E        : 1;
  __REG32                 :12;
} __er_edge_bits;

/* Interrupt clear enable register */

#define ER_CLR_EN_WAKEUP0_CLREN     (0x00000001UL)
#define ER_CLR_EN_WAKEUP1_CLREN     (0x00000002UL)
#define ER_CLR_EN_WAKEUP2_CLREN     (0x00000004UL)
#define ER_CLR_EN_WAKEUP3_CLREN     (0x00000008UL)
#define ER_CLR_EN_ATIMER_CLREN      (0x00000010UL)
#define ER_CLR_EN_RTC_CLREN         (0x00000020UL)
#define ER_CLR_EN_BOD_CLREN         (0x00000040UL)
#define ER_CLR_EN_WWDT_CLREN        (0x00000080UL)
#define ER_CLR_EN_ETH_CLREN         (0x00000100UL)
#define ER_CLR_EN_USB0_CLREN        (0x00000200UL)
#define ER_CLR_EN_USB1_CLREN        (0x00000400UL)
#define ER_CLR_EN_SDMMC_CLREN       (0x00000800UL)
#define ER_CLR_EN_CAN_CLREN         (0x00001000UL)
#define ER_CLR_EN_TIM2_CLREN        (0x00002000UL)
#define ER_CLR_EN_TIM6_CLREN        (0x00004000UL)
#define ER_CLR_EN_QEI_CLREN         (0x00008000UL)
#define ER_CLR_EN_TIM14_CLREN       (0x00010000UL)
#define ER_CLR_EN_RESET_CLREN       (0x00080000UL)

/* Interrupt set enable register */

#define ER_SET_EN_WAKEUP0_SETEN     (0x00000001UL)
#define ER_SET_EN_WAKEUP1_SETEN     (0x00000002UL)
#define ER_SET_EN_WAKEUP2_SETEN     (0x00000004UL)
#define ER_SET_EN_WAKEUP3_SETEN     (0x00000008UL)
#define ER_SET_EN_ATIMER_SETEN      (0x00000010UL)
#define ER_SET_EN_RTC_SETEN         (0x00000020UL)
#define ER_SET_EN_BOD_SETEN         (0x00000040UL)
#define ER_SET_EN_WWDT_SETEN        (0x00000080UL)
#define ER_SET_EN_ETH_SETEN         (0x00000100UL)
#define ER_SET_EN_USB0_SETEN        (0x00000200UL)
#define ER_SET_EN_USB1_SETEN        (0x00000400UL)
#define ER_SET_EN_SDMMC_SETEN       (0x00000800UL)
#define ER_SET_EN_CAN_SETEN         (0x00001000UL)
#define ER_SET_EN_TIM2_SETEN        (0x00002000UL)
#define ER_SET_EN_TIM6_SETEN        (0x00004000UL)
#define ER_SET_EN_QEI_SETEN         (0x00008000UL)
#define ER_SET_EN_TIM14_SETEN       (0x00010000UL)
#define ER_SET_EN_RESET_SETEN       (0x00080000UL)

/* Interrupt status register */
typedef struct {
  __REG32  WAKEUP0_ST     : 1;
  __REG32  WAKEUP1_ST     : 1;
  __REG32  WAKEUP2_ST     : 1;
  __REG32  WAKEUP3_ST     : 1;
  __REG32  ATIMER_ST      : 1;
  __REG32  RTC_ST         : 1;
  __REG32  BOD_ST         : 1;
  __REG32  WWDT_ST        : 1;
  __REG32  ETH_ST         : 1;
  __REG32  USB0_ST        : 1;
  __REG32  USB1_ST        : 1;
  __REG32  SDMMC_ST       : 1;
  __REG32  CAN_ST         : 1;
  __REG32  TIM2_ST        : 1;
  __REG32  TIM6_ST        : 1;
  __REG32  QEI_ST         : 1;
  __REG32  TIM14_ST       : 1;
  __REG32                 : 2;
  __REG32  RESET_ST       : 1;
  __REG32                 :12;
} __er_status_bits;

/* Event enable register */
typedef struct {
  __REG32  WAKEUP0_EN     : 1;
  __REG32  WAKEUP1_EN     : 1;
  __REG32  WAKEUP2_EN     : 1;
  __REG32  WAKEUP3_EN     : 1;
  __REG32  ATIMER_EN      : 1;
  __REG32  RTC_EN         : 1;
  __REG32  BOD_EN         : 1;
  __REG32  WWDT_EN        : 1;
  __REG32  ETH_EN         : 1;
  __REG32  USB0_EN        : 1;
  __REG32  USB1_EN        : 1;
  __REG32  SDMMC_EN       : 1;
  __REG32  CAN_EN         : 1;
  __REG32  TIM2_EN        : 1;
  __REG32  TIM6_EN        : 1;
  __REG32  QEI_EN         : 1;
  __REG32  TIM14_EN       : 1;
  __REG32                 : 2;
  __REG32  RESET_EN       : 1;
  __REG32                 :12;
} __er_enable_bits;

/* Interrupt clear status register */

#define ER_CLR_STAT_WAKEUP0_CLRST     (0x00000001UL)
#define ER_CLR_STAT_WAKEUP1_CLRST     (0x00000002UL)
#define ER_CLR_STAT_WAKEUP2_CLRST     (0x00000004UL)
#define ER_CLR_STAT_WAKEUP3_CLRST     (0x00000008UL)
#define ER_CLR_STAT_ATIMER_CLRST      (0x00000010UL)
#define ER_CLR_STAT_RTC_CLRST         (0x00000020UL)
#define ER_CLR_STAT_BOD_CLRST         (0x00000040UL)
#define ER_CLR_STAT_WWDT_CLRST        (0x00000080UL)
#define ER_CLR_STAT_ETH_CLRST         (0x00000100UL)
#define ER_CLR_STAT_USB0_CLRST        (0x00000200UL)
#define ER_CLR_STAT_USB1_CLRST        (0x00000400UL)
#define ER_CLR_STAT_SDMMC_CLRST       (0x00000800UL)
#define ER_CLR_STAT_CAN_CLRST         (0x00001000UL)
#define ER_CLR_STAT_TIM2_CLRST        (0x00002000UL)
#define ER_CLR_STAT_TIM6_CLRST        (0x00004000UL)
#define ER_CLR_STAT_QEI_CLRST         (0x00008000UL)
#define ER_CLR_STAT_TIM14_CLRST       (0x00010000UL)
#define ER_CLR_STAT_RESET_CLRST       (0x00080000UL)

/* Interrupt set status register */

#define ER_SET_STAT_WAKEUP0_SETST     (0x00000001UL)
#define ER_SET_STAT_WAKEUP1_SETST     (0x00000002UL)
#define ER_SET_STAT_WAKEUP2_SETST     (0x00000004UL)
#define ER_SET_STAT_WAKEUP3_SETST     (0x00000008UL)
#define ER_SET_STAT_ATIMER_SETST      (0x00000010UL)
#define ER_SET_STAT_RTC_SETST         (0x00000020UL)
#define ER_SET_STAT_BOD_SETST         (0x00000040UL)
#define ER_SET_STAT_WWDT_SETST        (0x00000080UL)
#define ER_SET_STAT_ETH_SETST         (0x00000100UL)
#define ER_SET_STAT_USB0_SETST        (0x00000200UL)
#define ER_SET_STAT_USB1_SETST        (0x00000400UL)
#define ER_SET_STAT_SDMMC_SETST       (0x00000800UL)
#define ER_SET_STAT_CAN_SETST         (0x00001000UL)
#define ER_SET_STAT_TIM2_SETST        (0x00002000UL)
#define ER_SET_STAT_TIM6_SETST        (0x00004000UL)
#define ER_SET_STAT_QEI_SETST         (0x00008000UL)
#define ER_SET_STAT_TIM14_SETST       (0x00010000UL)
#define ER_SET_STAT_RESET_SETST       (0x00080000UL)

/* MPU Type register */
typedef struct {
  __REG32  SEPARATE       : 1;
  __REG32                 : 7;
  __REG32  DREGION        : 8;
  __REG32  IREGION        : 8;
  __REG32                 : 8;
} __mpu_type_bits;

