una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4350_m4.h
/* MPU Control register */
typedef struct {
  __REG32  ENABLE         : 1;
  __REG32  HFNMIENA       : 1;
  __REG32  PRIVDEFENA     : 1;
  __REG32                 : 29;
} __mpu_ctrl_bits;

/* MPU Region Number register */
typedef struct {
  __REG32  REGION         : 8;
  __REG32                 : 24;
} __mpu_rnr_bits;

/* MPU Region Base Address register */
typedef struct {
  __REG32  REGION         : 4;
  __REG32  VALID          : 1;
  __REG32  ADDR           : 27;
} __mpu_rbar_bits;

/* MPU Region Attrbute and Size register */
typedef struct {
  __REG32  ENABLE         : 1;
  __REG32  SIZE           : 5;
  __REG32                 : 2;
  __REG32  SRD            : 8;
  __REG32  ATTR_B         : 1;
  __REG32  ATTR_C         : 1;
  __REG32  ATTR_S         : 1;
  __REG32  ATTR_TEX       : 3;
  __REG32                 : 2;
  __REG32  ATTR_AP        : 3;
  __REG32                 : 1;
  __REG32  ATTR_XN        : 1;
  __REG32                 : 3;
} __mpu_rasr_bits;


/* CREG0 control register */
typedef struct {
  __REG32  EN1KHZ         : 1;
  __REG32  EN32KHZ        : 1;
  __REG32  RESET32KHZ     : 1;
  __REG32  PD32KHZ        : 1;
  __REG32                 : 1;
  __REG32  USB0PHY        : 1;
  __REG32  ALARMCTRL      : 2;
  __REG32  BODLVL1        : 2;
  __REG32  BODLVL2        : 2;
  __REG32                 : 2;
  __REG32  WAKEUP0CTRL    : 2;
  __REG32  WAKEUP1CTRL    : 2;
  __REG32                 :14;
} __creg_creg0_bits;

/* Power mode control register */
/*
typedef struct {
  __REG32  PWRCTRL        : 9;
  __REG32                 : 6;
  __REG32  DYNAMICPWRCTRL : 1;
  __REG32                 :16;
} __creg_pmucon_bits;
*/

/* ARM Cortex-M4 Memory mapping register */
typedef struct {
  __REG32                 :12;
  __REG32  M4MAP          :20;
} __creg_m4memmap_bits;

/* CREG5 control register */
typedef struct {
  __REG32                 : 6;
  __REG32  M4TAPSEL       : 1;
  __REG32                 :25;
} __creg_creg5_bits;

/* DMA muxing register */
typedef struct {
  __REG32  DMAMUXCH0      : 2;
  __REG32  DMAMUXCH1      : 2;
  __REG32  DMAMUXCH2      : 2;
  __REG32  DMAMUXCH3      : 2;
  __REG32  DMAMUXCH4      : 2;
  __REG32  DMAMUXCH5      : 2;
  __REG32  DMAMUXCH6      : 2;
  __REG32  DMAMUXCH7      : 2;
  __REG32  DMAMUXCH8      : 2;
  __REG32  DMAMUXCH9      : 2;
  __REG32  DMAMUXCH10     : 2;
  __REG32  DMAMUXCH11     : 2;
  __REG32  DMAMUXCH12     : 2;
  __REG32  DMAMUXCH13     : 2;
  __REG32  DMAMUXCH14     : 2;
  __REG32  DMAMUXCH15     : 2;
} __creg_dmamux_bits;

/* ETB SRAM configuration register */
typedef struct {
  __REG32  ETB            : 1;
  __REG32                 :31;
} __creg_etbcfg_bits;

/* CREG6 control register */
typedef struct {
  __REG32  ETHMODE             : 3;
  __REG32                      : 1;
  __REG32  CTOUTCTRL           : 1;
  __REG32                      : 7;
  __REG32  I2S0_TX_SCK_IN_SEL  : 1;
  __REG32  I2S0_RX_SCK_IN_SEL  : 1;
  __REG32  I2S1_TX_SCK_IN_SEL  : 1;
  __REG32  I2S1_RX_SCK_IN_SEL  : 1;
  __REG32  EMC_CLK_SEL         : 1;
  __REG32                      :15;
} __creg_creg6_bits;

/* Cortex-M4 TXEV event clear register */
typedef struct {
  __REG32  TXEVCLR        : 1;
  __REG32                 :31;
} __creg_m4txevent_bits;

/* Cortex-M0 TXEV event clear register */
typedef struct {
  __REG32  TXEVCLR        : 1;
  __REG32                 :31;
} __creg_m0txevent_bits;

/* ARM Cortex-M0 memory mapping register */
typedef struct {
  __REG32                 :12;
  __REG32  M0APPMAP       :20;
} __creg_m0appmemmap_bits;


/* Hardware sleep event enable register */
typedef struct {
  __REG32  ENA_EVENT0     : 1;
  __REG32                 :31;
} __pmc_pd0_sleep0_hw_ena_bits;

/* Sleep power mode register */
typedef struct {
  __REG32  PWR_STATE      :32;
} __pmc_pd0_sleep0_mode_bits;


/* FREQ_MON register */
typedef struct {
  __REG32  RCNT           : 9;
  __REG32  FCNT           :14;
  __REG32  MEAS           : 1;
  __REG32  CLK_SEL        : 5;
  __REG32                 : 3;
} __cgu_freq_mon_bits;

/* XTAL_OSC_CTRL register */
typedef struct {
  __REG32  ENABLE         : 1;
  __REG32  BYPASS         : 1;
  __REG32  HF             : 1;
  __REG32                 :29;
} __cgu_xtal_osc_ctrl_bits;

/* PLL0USB_STAT register */
typedef struct {
  __REG32  LOCK           : 1;
  __REG32  FR             : 1;
  __REG32                 :30;
} __cgu_pll0usb_stat_bits;

/* PLL0USB control register */
typedef struct {
  __REG32  PD             : 1;
  __REG32  BYPASS         : 1;
  __REG32  DIRECTI        : 1;
  __REG32  DIRECTO        : 1;
  __REG32  CLKEN          : 1;
  __REG32                 : 1;
  __REG32  FRM            : 1;
  __REG32                 : 4;
  __REG32  AUTOBLOCK      : 1;
  __REG32                 :12;
  __REG32  CLK_SEL        : 5;
  __REG32                 : 3;
} __cgu_pll0usb_ctrl_bits;

/* PLL0USB_MDIV register */
typedef struct {
  __REG32  MDEC           :17;
  __REG32  SELP           : 5;
  __REG32  SELI           : 6;
  __REG32  SELR           : 4;
} __cgu_pll0usb_mdiv_bits;

/* PLL0USB NP-divider register */
typedef struct {
  __REG32  PDEC           : 7;
  __REG32                 : 5;
  __REG32  NDEC           :10;
  __REG32                 :10;
} __cgu_pll0usb_np_div_bits;

/* PLL0AUDIO_STAT register */
typedef struct {
  __REG32  LOCK           : 1;
  __REG32  FR             : 1;
  __REG32                 :30;
} __cgu_pll0audio_stat_bits;

/* PLL0AUDIO control register */
typedef struct {
  __REG32  PD             : 1;
  __REG32  BYPASS         : 1;
  __REG32  DIRECTI        : 1;
  __REG32  DIRECTO        : 1;
  __REG32  CLKEN          : 1;
  __REG32                 : 1;
  __REG32  FRM            : 1;
  __REG32                 : 4;
  __REG32  AUTOBLOCK      : 1;
  __REG32  PLLFRAQ_REQ    : 1;
  __REG32  SEL_EXT        : 1;
  __REG32  MOD_PD         : 1;
  __REG32                 : 9;
  __REG32  CLK_SEL        : 5;
  __REG32                 : 3;
} __cgu_pll0audio_ctrl_bits;

