una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4350_m4.h
/* MAC Configuration register */
typedef struct{
__REG32                 : 2;
__REG32 RE              : 1;
__REG32 TE              : 1;
__REG32 DF              : 1;
__REG32 BL              : 2;
__REG32 ACS             : 1;
__REG32                 : 1;
__REG32 DR              : 1;
__REG32 IPC             : 1;
__REG32 DM              : 1;
__REG32 LM              : 1;
__REG32 DO              : 1;
__REG32 FES             : 1;
__REG32 PS              : 1;
__REG32 DCRS            : 1;
__REG32 IFG             : 3;
__REG32 JE              : 1;
__REG32                 : 1;
__REG32 JD              : 1;
__REG32 WD              : 1;
__REG32                 : 8;
} __eth_mac_config_bits;

/* MAC Frame filter register */
typedef struct{
__REG32 PR              : 1;
__REG32                 : 2;
__REG32 DAIF            : 1;
__REG32 PM              : 1;
__REG32 DBF             : 1;
__REG32 PCF             : 2;
__REG32 SAIF            : 1;
__REG32 SAF             : 1;
__REG32                 :21;
__REG32 RA              : 1;
} __eth_mac_frame_filter_bits;

/* MAC GMII Address register */
typedef struct{
__REG32 GB              : 1;
__REG32 W               : 1;
__REG32 CR              : 4;
__REG32 GR              : 5;
__REG32 PA              : 5;
__REG32                 :16;
} __eth_mac_gmii_addr_bits;

/* MAC GMII Data register */
typedef struct{
__REG32 GD              :16;
__REG32                 :16;
} __eth_mac_gmii_data_bits;

/* MAC Flow control register */
typedef struct{
__REG32 FCB             : 1;
__REG32 TFE             : 1;
__REG32 RFE             : 1;
__REG32 UP              : 1;
__REG32 PLT             : 2;
__REG32                 : 1;
__REG32 DZPQ            : 1;
__REG32                 : 8;
__REG32 PT              :16;
} __eth_mac_flow_ctrl_bits;

/* MAC VLAN tag register */
typedef struct{
__REG32 VL              :16;
__REG32 ETV             : 1;
__REG32                 :15;
} __eth_mac_vlan_tag_bits;

/* MAC Debug register */
typedef struct{
__REG32 RXIDLESTAT      : 1;
__REG32 FIFOSTAT0       : 2;
__REG32                 : 1;
__REG32 RXFIFOSTAT1     : 1;
__REG32 RXFIFOSTAT      : 2;
__REG32                 : 1;
__REG32 RXFIFOLVL       : 2;
__REG32                 : 6;
__REG32 TXIDLESTAT      : 1;
__REG32 TXSTAT          : 2;
__REG32 PAUSE           : 1;
__REG32 TXFIFOSTAT      : 2;
__REG32 TXFIFOSTAT1     : 1;
__REG32                 : 1;
__REG32 TXFIFOLVL       : 1;
__REG32 TXFIFOFULL      : 1;
__REG32                 : 6;
} __eth_mac_debug_bits;

/* MAC PMT control and status register */
typedef struct{
__REG32 PD              : 1;
__REG32 MPE             : 1;
__REG32 WFE             : 1;
__REG32                 : 2;
__REG32 MPR             : 1;
__REG32 WFR             : 1;
__REG32                 : 2;
__REG32 GU              : 1;
__REG32                 :21;
__REG32 WFFRPR          : 1;
} __eth_mac_pmt_ctrl_stat_bits;

/* MAC Interrupt mask register */
typedef struct{
__REG32                 : 3;
__REG32 PMTMSK          : 1;
__REG32                 :28;
} __eth_mac_intr_mask_bits;

/* MAC Address 0 high register */
typedef struct{
__REG32 A47_32          :16;
__REG32                 :15;
__REG32 MO              : 1;
} __eth_mac_addr0_high_bits;

/* MAC IEEE1588 time stamp control register */
typedef struct{
__REG32 TSENA           : 1;
__REG32 TSCFUPDT        : 1;
__REG32 TSINIT          : 1;
__REG32 TSUPDT          : 1;
__REG32 TSTRIG          : 1;
__REG32 TSADDREG        : 1;
__REG32                 : 2;
__REG32 TSENALL         : 1;
__REG32 TSCTRLSSR       : 1;
__REG32 TSVER2ENA       : 1;
__REG32 TSIPENA         : 1;
__REG32 TSIPV6ENA       : 1;
__REG32 TSIPV4ENA       : 1;
__REG32 TSEVNTENA       : 1;
__REG32 TSMSTRENA       : 1;
__REG32 TSCLKTYPE       : 2;
__REG32 TSENMACADDR     : 1;
__REG32                 :13;
} __eth_mac_timestp_ctrl_bits;

/* Ethernet sub-second increment register */
typedef struct{
__REG32 SSINC           : 8;
__REG32                 :24;
} __eth_subsecond_incr_bits;

/* Ethernet system time seconds register */
typedef struct{
__REG32 TSS             :32;
} __eth_seconds_bits;

/* Ethernet system time nanoseconds register */
typedef struct{
__REG32 TSSS            :31;
__REG32 PSNT            :1;
} __eth_nanoseconds_bits;

/* Ethernet system time nanoseconds update register */
typedef struct{
__REG32 TSSS            :31;
__REG32 ADDSUB          :1;
} __eth_nanosecondsupdate_bits;

/* Ethernet timestamp addend register */
typedef struct{
__REG32 TSAR            :32;
} __eth_addend_bits;

/* Ethernet target time seconds register */
typedef struct{
__REG32 TSTR            :32;
} __eth_targetseconds_bits;

/* Ethernet target time nanoseconds register */
typedef struct{
__REG32 TSTR            :31;
__REG32                 : 1;
} __eth_targetnanoseconds_bits;

/* Ethernet system timer higher words seconds register */
typedef struct{
__REG32 TSHWR           :16;
__REG32                 :16;
} __eth_highword_bits;

/* Ethernet time stamp status register */
typedef struct{
__REG32 TSSOVF          :1;
__REG32 TSTARGT         :1;
__REG32 AUXSS           :1;
__REG32                 :21;
__REG32 ATSSTM          :1;
__REG32 ATSNS           :3;
__REG32                 :4;
} __eth_timestampstat_bits;

/* Ethernet PPS control register */
typedef struct{
__REG32 PPSCTRL         :4;
__REG32                 :28;
} __eth_ppsctrl_bits;

/* Ethernet auxiliary time stamp nanoseconds register */
typedef struct{
__REG32 AUXNS           :32;
} __eth_auxnanoseconds_bits;

/* Ethernet auxiliary time stamp seconds register */
typedef struct{
__REG32 AUXS            :32;
} __eth_auxseconds_bits;

/* DMA Bus mode register */
typedef struct{
__REG32 SWR             : 1;
__REG32 DA              : 1;
__REG32 DSL             : 5;
__REG32 ATDS            : 1;
__REG32 PBL             : 6;
__REG32 PR              : 2;
__REG32 FB              : 1;
__REG32 RPBL            : 6;
__REG32 USP             : 1;
__REG32 PBL8X           : 1;
__REG32 AAL             : 1;
__REG32 MB              : 1;
__REG32 TXPR            : 1;
__REG32                 : 2;
__REG32                 : 2;
} __eth_dma_bus_mode_bits;

/* DMA Status register */
typedef struct{
__REG32 TI              : 1;
__REG32 TPS             : 1;
__REG32 TU              : 1;
__REG32 TJT             : 1;
__REG32 OVF             : 1;
__REG32 UNF             : 1;
__REG32 RI              : 1;
__REG32 RU              : 1;
__REG32 RPS             : 1;
__REG32 RWT             : 1;
__REG32 ETI             : 1;
__REG32                 : 2;
__REG32 FBI             : 1;
__REG32 ERI             : 1;
__REG32 AIE             : 1;
__REG32 NIS             : 1;
__REG32                 :15;
} __eth_dma_stat_bits;

