una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4350_m4.h
/* Capture clear register */

#define MC_CAP_CLR_CAP_CLR0     (0x000000001UL)
#define MC_CAP_CLR_CAP_CLR1     (0x000000002UL)
#define MC_CAP_CLR_CAP_CLR2     (0x000000004UL)

/* QEI Control register */

#define QEI_CON_RESP            (0x000000001UL)
#define QEI_CON_RESPI           (0x000000002UL)
#define QEI_CON_RESV            (0x000000004UL)
#define QEI_CON_RESI            (0x000000008UL)

/* QEI Configuration register */
typedef struct{
__REG32 DIRINV      : 1;
__REG32 SIGMODE     : 1;
__REG32 CAPMODE     : 1;
__REG32 INVINX      : 1;
__REG32 CRESPI      : 1;
__REG32             :11;
__REG32 INXGATE     : 4;
__REG32             :12;
} __qei_conf_bits;

/* QEI Status register */
typedef struct{
__REG32 DIR         : 1;
__REG32             :31;
} __qei_stat_bits;


/* QEI Interrupt Clear register */

#define QEI_IEC_INX_EN      (0x00000001UL)
#define QEI_IEC_TIM_EN      (0x00000002UL)
#define QEI_IEC_VELC_EN     (0x00000004UL)
#define QEI_IEC_DIR_EN      (0x00000008UL)
#define QEI_IEC_ERR_EN      (0x00000010UL)
#define QEI_IEC_ENCLK_EN    (0x00000020UL)
#define QEI_IEC_POS0_INT    (0x00000040UL)
#define QEI_IEC_POS1_INT    (0x00000080UL)
#define QEI_IEC_POS2_INT    (0x00000100UL)
#define QEI_IEC_REV0_INT    (0x00000200UL)
#define QEI_IEC_POS0REV_INT (0x00000400UL)
#define QEI_IEC_POS1REV_INT (0x00000800UL)
#define QEI_IEC_POS2REV_INT (0x00001000UL)
#define QEI_IEC_REV1_INT    (0x00002000UL)
#define QEI_IEC_REV2_INT    (0x00004000UL)
#define QEI_IEC_MAXPOS_INT  (0x00008000UL)

/* QEI Interrupt Set register */

#define QEI_IES_INX_EN      (0x00000001UL)
#define QEI_IES_TIM_EN      (0x00000002UL)
#define QEI_IES_VELC_EN     (0x00000004UL)
#define QEI_IES_DIR_EN      (0x00000008UL)
#define QEI_IES_ERR_EN      (0x00000010UL)
#define QEI_IES_ENCLK_EN    (0x00000020UL)
#define QEI_IES_POS0_Int    (0x00000040UL)
#define QEI_IES_POS1_Int    (0x00000080UL)
#define QEI_IES_POS2_Int    (0x00000100UL)
#define QEI_IES_REV0_Int    (0x00000200UL)
#define QEI_IES_POS0REV_Int (0x00000400UL)
#define QEI_IES_POS1REV_Int (0x00000800UL)
#define QEI_IES_POS2REV_Int (0x00001000UL)
#define QEI_IES_REV1_Int    (0x00002000UL)
#define QEI_IES_REV2_Int    (0x00004000UL)
#define QEI_IES_MAXPOS_Int  (0x00008000UL)

/* QEI Interrupt Status register */
/* QEI Interrupt Enable register */
typedef struct{
__REG32 INX_Int     : 1;
__REG32 TIM_Int     : 1;
__REG32 VELC_Int    : 1;
__REG32 DIR_Int     : 1;
__REG32 ERR_Int     : 1;
__REG32 ENCLK_Int   : 1;
__REG32 POS0_Int    : 1;
__REG32 POS1_Int    : 1;
__REG32 POS2_Int    : 1;
__REG32 REV0_Int    : 1;
__REG32 POS0REV_Int : 1;
__REG32 POS1REV_Int : 1;
__REG32 POS2REV_Int : 1;
__REG32 REV1_Int    : 1;
__REG32 REV2_Int    : 1;
__REG32 MAXPOS_Int  : 1;
__REG32             :16;
} __qei_intstat_bits;

/* QEI Interrupt Clear register */

#define QEI_CLR_INX_Int      (0x00000001UL)
#define QEI_CLR_TIM_Int      (0x00000002UL)
#define QEI_CLR_VELC_Int     (0x00000004UL)
#define QEI_CLR_DIR_Int      (0x00000008UL)
#define QEI_CLR_ERR_Int      (0x00000010UL)
#define QEI_CLR_ENCLK_Int    (0x00000020UL)
#define QEI_CLR_POS0_Int     (0x00000040UL)
#define QEI_CLR_POS1_Int     (0x00000080UL)
#define QEI_CLR_POS2_Int     (0x00000100UL)
#define QEI_CLR_REV0_Int     (0x00000200UL)
#define QEI_CLR_POS0REV_Int  (0x00000400UL)
#define QEI_CLR_POS1REV_Int  (0x00000800UL)
#define QEI_CLR_POS2REV_Int  (0x00001000UL)
#define QEI_CLR_REV1_Int     (0x00002000UL)
#define QEI_CLR_REV2_Int     (0x00004000UL)
#define QEI_CLR_MAXPOS_Int   (0x00008000UL)

/* QEI Interrupt Set register */

#define QEI_SET_INX_Int      (0x00000001UL)
#define QEI_SET_TIM_Int      (0x00000002UL)
#define QEI_SET_VELC_Int     (0x00000004UL)
#define QEI_SET_DIR_Int      (0x00000008UL)
#define QEI_SET_ERR_Int      (0x00000010UL)
#define QEI_SET_ENCLK_Int    (0x00000020UL)
#define QEI_SET_POS0_Int     (0x00000040UL)
#define QEI_SET_POS1_Int     (0x00000080UL)
#define QEI_SET_POS2_Int     (0x00000100UL)
#define QEI_SET_REV0_Int     (0x00000200UL)
#define QEI_SET_POS0REV_Int  (0x00000400UL)
#define QEI_SET_POS1REV_Int  (0x00000800UL)
#define QEI_SET_POS2REV_Int  (0x00001000UL)
#define QEI_SET_REV1_Int     (0x00002000UL)
#define QEI_SET_REV2_Int     (0x00004000UL)
#define QEI_SET_MAXPOS_Int   (0x00008000UL)


/* RIT Control register */
typedef struct{
__REG32 RITINT   : 1;
__REG32 RITENCLR : 1;
__REG32 RITENBR  : 1;
__REG32 RITEN    : 1;
__REG32          :28;
} __rit_ctrl_bits;


/* Downcounter register */
typedef struct{
__REG32 CVAL     :16;
__REG32          :16;
} __at_downcounter_bits;

/* Preset value register */
typedef struct{
__REG32 PRESETVAL :16;
__REG32           :16;
} __at_preset_bits;

/* Interrupt clear enable register */

#define AT_CLR_EN_CLR_EN      (0x00000001UL)

/* Interrupt set enable register */

#define AT_SET_EN_SET_EN      (0x00000001UL)

/* Interrupt status register */
typedef struct{
__REG32 STAT     : 1;
__REG32          :31;
} __at_status_bits;

/* Interrupt enable register */
typedef struct{
__REG32 EN       : 1;
__REG32          :31;
} __at_enable_bits;

/* Clear status register */

#define AT_CLR_STAT_CSTAT     (0x00000001UL)

/* Set status register */

#define AT_SET_STAT_SSTAT     (0x00000001UL)

/* Watchdog mode register */
typedef struct{
__REG32 WDEN     : 1;
__REG32 WDRESET  : 1;
__REG32 WDTOF    : 1;
__REG32 WDINT    : 1;
__REG32 WDPROTECT: 1;
__REG32          :27;
} __wwdt_mod_bits;

/* Watchdog Timer Constant register */
typedef struct{
__REG32 WDTC     :24;
__REG32          : 8;
} __wwdt_tc_bits;

/* Watchdog feed register */

#define WWDT_FEED_Feed     (0x000000FFUL)

/* Watchdog Timer Value register */
typedef struct{
__REG32 Count    :24;
__REG32          : 8;
} __wwdt_tv_bits;

/* Watchdog Timer Warning Interrupt register */
typedef struct{
__REG32 WDWARNINT :10;
__REG32           :22;
} __wwdt_warnint_bits;

/* Watchdog Timer Window register */
typedef struct{
__REG32 WDWINDOW  :24;
__REG32           : 8;
} __wwdt_window_bits;


/* RTC interrupt location register */

#define RTC_ILR_RTCCIF     (0x00000001UL)
#define RTC_ILR_RTCALF     (0x00000002UL)

/* RTC clock control register */
typedef struct{
__REG32 CLKEN   : 1;
__REG32 CTCRST  : 1;
__REG32         : 2;
__REG32 CCALEN  : 1;
__REG32         :27;
} __rtc_ccr_bits;

/* RTC counter increment interrupt register */
typedef struct{
__REG32 IMSEC   : 1;
__REG32 IMMIN   : 1;
__REG32 IMHOUR  : 1;
__REG32 IMDOM   : 1;
__REG32 IMDOW   : 1;
__REG32 IMDOY   : 1;
__REG32 IMMON   : 1;
__REG32 IMYEAR  : 1;
__REG32         :24;
} __rtc_ciir_bits;

/* RTC Counter Increment Select Mask Register */
typedef struct{
__REG32 CALVAL    :17;
__REG32 CALDIR    : 1;
__REG32           :14;
} __rtc_calibration_bits;

/* RTC alarm mask register */
typedef struct{
__REG32 AMRSEC   : 1;
__REG32 AMRMIN   : 1;
__REG32 AMRHOUR  : 1;
__REG32 AMRDOM   : 1;
__REG32 AMRDOW   : 1;
__REG32 AMRDOY   : 1;
__REG32 AMRMON   : 1;
__REG32 AMRYEAR  : 1;
__REG32          :24;
} __rtc_amr_bits;

