una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4350_m4.h
/* CAN message interface command arbitration 1 registers */
typedef struct{
__REG32  ID15_0         :16;
__REG32                 :16;
} __can_ifx_arb1_bits;

/* CAN message interface command arbitration 2 registers */
typedef struct{
__REG32  ID28_16        :13;
__REG32  DIR            : 1;
__REG32  XTD            : 1;
__REG32  MSGVAL         : 1;
__REG32                 :16;
} __can_ifx_arb2_bits;

/* CAN message interface message control registers */
typedef struct{
__REG32  DLC3_0         : 4;
__REG32                 : 3;
__REG32  EOB            : 1;
__REG32  TXRQST         : 1;
__REG32  RMTEN          : 1;
__REG32  RXIE           : 1;
__REG32  TXIE           : 1;
__REG32  UMASK          : 1;
__REG32  INTPND         : 1;
__REG32  MSGLST         : 1;
__REG32  NEWDAT         : 1;
__REG32                 :16;
} __can_ifx_mctrl_bits;

/* CAN message interface data A1 registers */
typedef struct{
__REG32  DATA0          : 8;
__REG32  DATA1          : 8;
__REG32                 :16;
} __can_ifx_da1_bits;

/* CAN message interface data A2 registers */
typedef struct{
__REG32  DATA2          : 8;
__REG32  DATA3          : 8;
__REG32                 :16;
} __can_ifx_da2_bits;

/* CAN message interface data B1 registers */
typedef struct{
__REG32  DATA4          : 8;
__REG32  DATA5          : 8;
__REG32                 :16;
} __can_ifx_db1_bits;

/* CAN message interface data B2 registers */
typedef struct{
__REG32  DATA6          : 8;
__REG32  DATA7          : 8;
__REG32                 :16;
} __can_ifx_db2_bits;

/* CAN transmission request 1 register */
typedef struct{
__REG32  TXRQST1        : 1;
__REG32  TXRQST2        : 1;
__REG32  TXRQST3        : 1;
__REG32  TXRQST4        : 1;
__REG32  TXRQST5        : 1;
__REG32  TXRQST6        : 1;
__REG32  TXRQST7        : 1;
__REG32  TXRQST8        : 1;
__REG32  TXRQST9        : 1;
__REG32  TXRQST10       : 1;
__REG32  TXRQST11       : 1;
__REG32  TXRQST12       : 1;
__REG32  TXRQST13       : 1;
__REG32  TXRQST14       : 1;
__REG32  TXRQST15       : 1;
__REG32  TXRQST16       : 1;
__REG32                 :16;
} __can_txreq1_bits;

/* CAN transmission request 2 register */
typedef struct{
__REG32  TXRQST17       : 1;
__REG32  TXRQST18       : 1;
__REG32  TXRQST19       : 1;
__REG32  TXRQST20       : 1;
__REG32  TXRQST21       : 1;
__REG32  TXRQST22       : 1;
__REG32  TXRQST23       : 1;
__REG32  TXRQST24       : 1;
__REG32  TXRQST25       : 1;
__REG32  TXRQST26       : 1;
__REG32  TXRQST27       : 1;
__REG32  TXRQST28       : 1;
__REG32  TXRQST29       : 1;
__REG32  TXRQST30       : 1;
__REG32  TXRQST31       : 1;
__REG32  TXRQST32       : 1;
__REG32                 :16;
} __can_txreq2_bits;

/* CAN new data 1 register */
typedef struct{
__REG32  NEWDAT1        : 1;
__REG32  NEWDAT2        : 1;
__REG32  NEWDAT3        : 1;
__REG32  NEWDAT4        : 1;
__REG32  NEWDAT5        : 1;
__REG32  NEWDAT6        : 1;
__REG32  NEWDAT7        : 1;
__REG32  NEWDAT8        : 1;
__REG32  NEWDAT9        : 1;
__REG32  NEWDAT10       : 1;
__REG32  NEWDAT11       : 1;
__REG32  NEWDAT12       : 1;
__REG32  NEWDAT13       : 1;
__REG32  NEWDAT14       : 1;
__REG32  NEWDAT15       : 1;
__REG32  NEWDAT16       : 1;
__REG32                 :16;
} __can_nd1_bits;

/* CAN new data 2 register */
typedef struct{
__REG32  NEWDAT17       : 1;
__REG32  NEWDAT18       : 1;
__REG32  NEWDAT19       : 1;
__REG32  NEWDAT20       : 1;
__REG32  NEWDAT21       : 1;
__REG32  NEWDAT22       : 1;
__REG32  NEWDAT23       : 1;
__REG32  NEWDAT24       : 1;
__REG32  NEWDAT25       : 1;
__REG32  NEWDAT26       : 1;
__REG32  NEWDAT27       : 1;
__REG32  NEWDAT28       : 1;
__REG32  NEWDAT29       : 1;
__REG32  NEWDAT30       : 1;
__REG32  NEWDAT31       : 1;
__REG32  NEWDAT32       : 1;
__REG32                 :16;
} __can_nd2_bits;

/* CAN interrupt pending 1 register */
typedef struct{
__REG32  INTPND1        : 1;
__REG32  INTPND2        : 1;
__REG32  INTPND3        : 1;
__REG32  INTPND4        : 1;
__REG32  INTPND5        : 1;
__REG32  INTPND6        : 1;
__REG32  INTPND7        : 1;
__REG32  INTPND8        : 1;
__REG32  INTPND9        : 1;
__REG32  INTPND10       : 1;
__REG32  INTPND11       : 1;
__REG32  INTPND12       : 1;
__REG32  INTPND13       : 1;
__REG32  INTPND14       : 1;
__REG32  INTPND15       : 1;
__REG32  INTPND16       : 1;
__REG32                 :16;
} __can_ir1_bits;

/* CAN interrupt pending 2 register */
typedef struct{
__REG32  INTPND17       : 1;
__REG32  INTPND18       : 1;
__REG32  INTPND19       : 1;
__REG32  INTPND20       : 1;
__REG32  INTPND21       : 1;
__REG32  INTPND22       : 1;
__REG32  INTPND23       : 1;
__REG32  INTPND24       : 1;
__REG32  INTPND25       : 1;
__REG32  INTPND26       : 1;
__REG32  INTPND27       : 1;
__REG32  INTPND28       : 1;
__REG32  INTPND29       : 1;
__REG32  INTPND30       : 1;
__REG32  INTPND31       : 1;
__REG32  INTPND32       : 1;
__REG32                 :16;
} __can_ir2_bits;

/* CAN message valid 1 register */
typedef struct{
__REG32  MSGVAL1        : 1;
__REG32  MSGVAL2        : 1;
__REG32  MSGVAL3        : 1;
__REG32  MSGVAL4        : 1;
__REG32  MSGVAL5        : 1;
__REG32  MSGVAL6        : 1;
__REG32  MSGVAL7        : 1;
__REG32  MSGVAL8        : 1;
__REG32  MSGVAL9        : 1;
__REG32  MSGVAL10       : 1;
__REG32  MSGVAL11       : 1;
__REG32  MSGVAL12       : 1;
__REG32  MSGVAL13       : 1;
__REG32  MSGVAL14       : 1;
__REG32  MSGVAL15       : 1;
__REG32  MSGVAL16       : 1;
__REG32                 :16;
} __can_msgv1_bits;

/* CAN message valid 2 register */
typedef struct{
__REG32  MSGVAL17       : 1;
__REG32  MSGVAL18       : 1;
__REG32  MSGVAL19       : 1;
__REG32  MSGVAL20       : 1;
__REG32  MSGVAL21       : 1;
__REG32  MSGVAL22       : 1;
__REG32  MSGVAL23       : 1;
__REG32  MSGVAL24       : 1;
__REG32  MSGVAL25       : 1;
__REG32  MSGVAL26       : 1;
__REG32  MSGVAL27       : 1;
__REG32  MSGVAL28       : 1;
__REG32  MSGVAL29       : 1;
__REG32  MSGVAL30       : 1;
__REG32  MSGVAL31       : 1;
__REG32  MSGVAL32       : 1;
__REG32                 :16;
} __can_msgv2_bits;

/* CAN clock divider register */
typedef struct{
__REG32  CLKDIVVAL      : 3;
__REG32                 :29;
} __can_clkdiv_bits;


/* I2S Digital Audio Output Registes */
typedef struct{
__REG32 WORDWIDTH     : 2;
__REG32 MONO          : 1;
__REG32 STOP          : 1;
__REG32 RESET         : 1;
__REG32 WS_SEL        : 1;
__REG32 WS_HALFPERIOD : 9;
__REG32 MUTE          : 1;
__REG32               :16;
} __i2s_dao_bits;

