una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4350_m4.h
/* SPI clock counter register */
typedef struct{
__REG32 COUNTER  : 8;
__REG32          :24;
} __spi_ccr_bits;

/* SPI Data Register */
typedef struct{
__REG32 DATALOW  : 8;
__REG32 DATAHIGH : 8;
__REG32          :16;
} __spi_dr_bits;

/* SPI interrupt register */
typedef struct{
__REG32 SPIIF   : 1;
__REG32         :31;
} __spi_int_bits;

/* SPI Test control register */
typedef struct{
__REG32          : 1;
__REG32  TEST    : 7;
__REG32          :24;
} __spi_tcr_bits;

/* SPI Test Status Register */
typedef struct{
__REG32          : 3;
__REG32  ABRT    : 1;
__REG32  MODF    : 1;
__REG32  ROVR    : 1;
__REG32  WCOL    : 1;
__REG32  SPIF    : 1;
__REG32          :24;
} __spi_tsr_bits;


/* OTP Bank 3  Word 0 */
typedef struct{
__REG32                    :23;
__REG32  USB_ID_ENABLE     : 1;
__REG32                    : 1;
__REG32  BOOT_SRC          : 4;
__REG32  AES_KEY2_LOCK     : 1;
__REG32  AES_KEY1_LOCK     : 1;
__REG32  JTAG_DISABLE      : 1;
} __otp_b3_w0_bits;

/* OTP Bank 3  Word 1 */
typedef struct{
__REG32  USB_VENDOR_ID     :16;
__REG32  USB_PRODUCT_ID    :16;
} __otp_b3_w1_bits;

/* OTP Bank 3  Word 2 */
typedef struct{
__REG32  ETH_MAC           :32;
} __otp_b3_w2_bits;


#endif    /* __IAR_SYSTEMS_ICC__ */

/* Declarations common to compiler and assembler **************************/

/***************************************************************************
 **
 ** SCS
 **
 ***************************************************************************/
__IO_REG32_BIT(NVIC_ICTR,             0xE000E004,__READ       ,__nvic_ictr_bits);
#define NVIC      NVIC_ICTR
#define NVIC_bit  NVIC_ICTR_bit
__IO_REG32_BIT(ACTLR,                 0xE000E008,__READ_WRITE ,__actlr_bits);
__IO_REG32_BIT(SYSTICK_CSR,           0xE000E010,__READ_WRITE ,__systick_csr_bits);
#define STCSR      SYSTICK_CSR
#define STCSR_bit  SYSTICK_CSR_bit
__IO_REG32_BIT(SYSTICK_RVR,           0xE000E014,__READ_WRITE ,__systick_rvr_bits);
#define STRVR      SYSTICK_RVR
#define STRVR_bit  SYSTICK_RVR_bit
__IO_REG32_BIT(SYSTICK_CVR,           0xE000E018,__READ_WRITE ,__systick_cvr_bits);
#define STCVR      SYSTICK_CVR
#define STCVR_bit  SYSTICK_CVR_bit
__IO_REG32_BIT(SYSTICK_CALVR,         0xE000E01C,__READ       ,__systick_calvr_bits);
#define STCR      SYSTICK_CALVR
#define STCR_bit  SYSTICK_CALVR_bit

__IO_REG32_BIT(NVIC_ISER0,            0xE000E100,__READ_WRITE ,__nvic_iser0_bits);
__IO_REG32_BIT(NVIC_ISER1,            0xE000E104,__READ_WRITE ,__nvic_iser1_bits);

__IO_REG32_BIT(NVIC_ICER0,            0xE000E180,__READ_WRITE ,__nvic_icer0_bits);
__IO_REG32_BIT(NVIC_ICER1,            0xE000E184,__READ_WRITE ,__nvic_icer1_bits);

__IO_REG32_BIT(NVIC_ISPR0,            0xE000E200,__READ_WRITE ,__nvic_ispr0_bits);
__IO_REG32_BIT(NVIC_ISPR1,            0xE000E204,__READ_WRITE ,__nvic_ispr1_bits);

__IO_REG32_BIT(NVIC_ICPR0,            0xE000E280,__READ_WRITE ,__nvic_icpr0_bits);
__IO_REG32_BIT(NVIC_ICPR1,            0xE000E284,__READ_WRITE ,__nvic_icpr1_bits);

__IO_REG32_BIT(NVIC_IABR0,            0xE000E300,__READ       ,__nvic_iabr0_bits);
__IO_REG32_BIT(NVIC_IABR1,            0xE000E304,__READ       ,__nvic_iabr1_bits);

__IO_REG32_BIT(NVIC_IPR0,             0xE000E400,__READ_WRITE ,__nvic_ipr0_bits);
__IO_REG32_BIT(NVIC_IPR1,             0xE000E404,__READ_WRITE ,__nvic_ipr1_bits);
__IO_REG32_BIT(NVIC_IPR2,             0xE000E408,__READ_WRITE ,__nvic_ipr2_bits);
__IO_REG32_BIT(NVIC_IPR3,             0xE000E40C,__READ_WRITE ,__nvic_ipr3_bits);
__IO_REG32_BIT(NVIC_IPR4,             0xE000E410,__READ_WRITE ,__nvic_ipr4_bits);
__IO_REG32_BIT(NVIC_IPR5,             0xE000E414,__READ_WRITE ,__nvic_ipr5_bits);
__IO_REG32_BIT(NVIC_IPR6,             0xE000E418,__READ_WRITE ,__nvic_ipr6_bits);
__IO_REG32_BIT(NVIC_IPR7,             0xE000E41C,__READ_WRITE ,__nvic_ipr7_bits);
__IO_REG32_BIT(NVIC_IPR8,             0xE000E420,__READ_WRITE ,__nvic_ipr8_bits);
__IO_REG32_BIT(NVIC_IPR9,             0xE000E424,__READ_WRITE ,__nvic_ipr9_bits);
__IO_REG32_BIT(NVIC_IPR10,            0xE000E428,__READ_WRITE ,__nvic_ipr10_bits);
__IO_REG32_BIT(NVIC_IPR11,            0xE000E42C,__READ_WRITE ,__nvic_ipr11_bits);
__IO_REG32_BIT(NVIC_IPR12,            0xE000E430,__READ_WRITE ,__nvic_ipr12_bits);
__IO_REG32_BIT(NVIC_IPR13,            0xE000E434,__READ_WRITE ,__nvic_ipr13_bits);

__IO_REG32_BIT(CPUID,                 0xE000ED00,__READ       ,__cpuid_bits);
__IO_REG32_BIT(ICSR,                  0xE000ED04,__READ_WRITE ,__icsr_bits);
__IO_REG32_BIT(VTOR,                  0xE000ED08,__READ_WRITE ,__vtor_bits);
__IO_REG32_BIT(AIRCR,                 0xE000ED0C,__READ_WRITE ,__aircr_bits);
__IO_REG32_BIT(SCR,                   0xE000ED10,__READ_WRITE ,__scr_bits);
__IO_REG32_BIT(CCR,                   0xE000ED14,__READ_WRITE ,__ccr_bits);
__IO_REG32_BIT(SHPR1,                 0xE000ED18,__READ_WRITE ,__nvic_ipr1_bits);
__IO_REG32_BIT(SHPR2,                 0xE000ED1C,__READ_WRITE ,__nvic_ipr2_bits);
__IO_REG32_BIT(SHPR3,                 0xE000ED20,__READ_WRITE ,__nvic_ipr3_bits);
__IO_REG32_BIT(SHCSR,                 0xE000ED24,__READ_WRITE ,__shcsr_bits);
__IO_REG32_BIT(CFSR,                  0xE000ED28,__READ_WRITE ,__cfsr_bits);
__IO_REG32_BIT(HFSR,                  0xE000ED2C,__READ_WRITE ,__hfsr_bits);
__IO_REG32_BIT(DFSR,                  0xE000ED30,__READ_WRITE ,__dfsr_bits);
__IO_REG32(    MMFAR,                 0xE000ED34,__READ_WRITE);
__IO_REG32(    BFAR,                  0xE000ED38,__READ_WRITE);
__IO_REG32(    AFSR,                  0xE000ED3C,__READ_WRITE);
__IO_REG32(    ID_PFR0,               0xE000ED40,__READ       );
__IO_REG32(    ID_PFR1,               0xE000ED44,__READ       );
__IO_REG32(    ID_DFR0,               0xE000ED48,__READ       );
__IO_REG32(    ID_AFR0,               0xE000ED4C,__READ       );

__IO_REG32(    ID_MMFR0,              0xE000ED50,__READ       );
__IO_REG32(    ID_MMFR1,              0xE000ED54,__READ       );
__IO_REG32(    ID_MMFR2,              0xE000ED58,__READ       );
__IO_REG32(    ID_MMFR3,              0xE000ED5C,__READ       );

__IO_REG32(    ID_ISAR0,              0xE000ED60,__READ       );
__IO_REG32(    ID_ISAR1,              0xE000ED64,__READ       );
__IO_REG32(    ID_ISAR2,              0xE000ED68,__READ       );
__IO_REG32(    ID_ISAR3,              0xE000ED6C,__READ       );
__IO_REG32(    ID_ISAR4,              0xE000ED70,__READ       );

