una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4350_m4.h
__IO_REG8(     GPIO_B32,          0x400F4020,__READ_WRITE);
__IO_REG8(     GPIO_B33,          0x400F4021,__READ_WRITE);
__IO_REG8(     GPIO_B34,          0x400F4022,__READ_WRITE);
__IO_REG8(     GPIO_B35,          0x400F4023,__READ_WRITE);
__IO_REG8(     GPIO_B36,          0x400F4024,__READ_WRITE);
__IO_REG8(     GPIO_B37,          0x400F4025,__READ_WRITE);
__IO_REG8(     GPIO_B38,          0x400F4026,__READ_WRITE);
__IO_REG8(     GPIO_B39,          0x400F4027,__READ_WRITE);
__IO_REG8(     GPIO_B40,          0x400F4028,__READ_WRITE);
__IO_REG8(     GPIO_B41,          0x400F4029,__READ_WRITE);
__IO_REG8(     GPIO_B42,          0x400F402A,__READ_WRITE);
__IO_REG8(     GPIO_B43,          0x400F402B,__READ_WRITE);
__IO_REG8(     GPIO_B44,          0x400F402C,__READ_WRITE);
__IO_REG8(     GPIO_B45,          0x400F402D,__READ_WRITE);
__IO_REG8(     GPIO_B46,          0x400F402E,__READ_WRITE);
__IO_REG8(     GPIO_B47,          0x400F402F,__READ_WRITE);

__IO_REG8(     GPIO_B64,          0x400F4040,__READ_WRITE);
__IO_REG8(     GPIO_B65,          0x400F4041,__READ_WRITE);
__IO_REG8(     GPIO_B66,          0x400F4042,__READ_WRITE);
__IO_REG8(     GPIO_B67,          0x400F4043,__READ_WRITE);
__IO_REG8(     GPIO_B68,          0x400F4044,__READ_WRITE);
__IO_REG8(     GPIO_B69,          0x400F4045,__READ_WRITE);
__IO_REG8(     GPIO_B70,          0x400F4046,__READ_WRITE);
__IO_REG8(     GPIO_B71,          0x400F4047,__READ_WRITE);
__IO_REG8(     GPIO_B72,          0x400F4048,__READ_WRITE);
__IO_REG8(     GPIO_B73,          0x400F4049,__READ_WRITE);
__IO_REG8(     GPIO_B74,          0x400F404A,__READ_WRITE);
__IO_REG8(     GPIO_B75,          0x400F404B,__READ_WRITE);
__IO_REG8(     GPIO_B76,          0x400F404C,__READ_WRITE);
__IO_REG8(     GPIO_B77,          0x400F404D,__READ_WRITE);
__IO_REG8(     GPIO_B78,          0x400F404E,__READ_WRITE);
__IO_REG8(     GPIO_B79,          0x400F404F,__READ_WRITE);

__IO_REG8(     GPIO_B96,          0x400F4060,__READ_WRITE);
__IO_REG8(     GPIO_B97,          0x400F4061,__READ_WRITE);
__IO_REG8(     GPIO_B98,          0x400F4062,__READ_WRITE);
__IO_REG8(     GPIO_B99,          0x400F4063,__READ_WRITE);
__IO_REG8(     GPIO_B100,         0x400F4064,__READ_WRITE);
__IO_REG8(     GPIO_B101,         0x400F4065,__READ_WRITE);
__IO_REG8(     GPIO_B102,         0x400F4066,__READ_WRITE);
__IO_REG8(     GPIO_B103,         0x400F4067,__READ_WRITE);
__IO_REG8(     GPIO_B104,         0x400F4068,__READ_WRITE);
__IO_REG8(     GPIO_B105,         0x400F4069,__READ_WRITE);
__IO_REG8(     GPIO_B106,         0x400F406A,__READ_WRITE);
__IO_REG8(     GPIO_B107,         0x400F406B,__READ_WRITE);
__IO_REG8(     GPIO_B108,         0x400F406C,__READ_WRITE);
__IO_REG8(     GPIO_B109,         0x400F406D,__READ_WRITE);
__IO_REG8(     GPIO_B110,         0x400F406E,__READ_WRITE);
__IO_REG8(     GPIO_B111,         0x400F406F,__READ_WRITE);

__IO_REG8(     GPIO_B128,         0x400F4080,__READ_WRITE);
__IO_REG8(     GPIO_B129,         0x400F4081,__READ_WRITE);
__IO_REG8(     GPIO_B130,         0x400F4082,__READ_WRITE);
__IO_REG8(     GPIO_B131,         0x400F4083,__READ_WRITE);
__IO_REG8(     GPIO_B132,         0x400F4084,__READ_WRITE);
__IO_REG8(     GPIO_B133,         0x400F4085,__READ_WRITE);
__IO_REG8(     GPIO_B134,         0x400F4086,__READ_WRITE);
__IO_REG8(     GPIO_B135,         0x400F4087,__READ_WRITE);
__IO_REG8(     GPIO_B136,         0x400F4088,__READ_WRITE);
__IO_REG8(     GPIO_B137,         0x400F4089,__READ_WRITE);
__IO_REG8(     GPIO_B138,         0x400F408A,__READ_WRITE);
__IO_REG8(     GPIO_B139,         0x400F408B,__READ_WRITE);
__IO_REG8(     GPIO_B140,         0x400F408C,__READ_WRITE);
__IO_REG8(     GPIO_B141,         0x400F408D,__READ_WRITE);
__IO_REG8(     GPIO_B142,         0x400F408E,__READ_WRITE);
__IO_REG8(     GPIO_B143,         0x400F408F,__READ_WRITE);

__IO_REG8(     GPIO_B160,         0x400F40A0,__READ_WRITE);
__IO_REG8(     GPIO_B161,         0x400F40A1,__READ_WRITE);
__IO_REG8(     GPIO_B162,         0x400F40A2,__READ_WRITE);
__IO_REG8(     GPIO_B163,         0x400F40A3,__READ_WRITE);
__IO_REG8(     GPIO_B164,         0x400F40A4,__READ_WRITE);
__IO_REG8(     GPIO_B165,         0x400F40A5,__READ_WRITE);
__IO_REG8(     GPIO_B166,         0x400F40A6,__READ_WRITE);
__IO_REG8(     GPIO_B167,         0x400F40A7,__READ_WRITE);
__IO_REG8(     GPIO_B168,         0x400F40A8,__READ_WRITE);
__IO_REG8(     GPIO_B169,         0x400F40A9,__READ_WRITE);
__IO_REG8(     GPIO_B170,         0x400F40AA,__READ_WRITE);
__IO_REG8(     GPIO_B171,         0x400F40AB,__READ_WRITE);
__IO_REG8(     GPIO_B172,         0x400F40AC,__READ_WRITE);
__IO_REG8(     GPIO_B173,         0x400F40AD,__READ_WRITE);
__IO_REG8(     GPIO_B174,         0x400F40AE,__READ_WRITE);
__IO_REG8(     GPIO_B175,         0x400F40AF,__READ_WRITE);
__IO_REG8(     GPIO_B176,         0x400F40B0,__READ_WRITE);
__IO_REG8(     GPIO_B177,         0x400F40B1,__READ_WRITE);
__IO_REG8(     GPIO_B178,         0x400F40B2,__READ_WRITE);
__IO_REG8(     GPIO_B179,         0x400F40B3,__READ_WRITE);
__IO_REG8(     GPIO_B180,         0x400F40B4,__READ_WRITE);
__IO_REG8(     GPIO_B181,         0x400F40B5,__READ_WRITE);
__IO_REG8(     GPIO_B182,         0x400F40B6,__READ_WRITE);
__IO_REG8(     GPIO_B183,         0x400F40B7,__READ_WRITE);
__IO_REG8(     GPIO_B184,         0x400F40B8,__READ_WRITE);
__IO_REG8(     GPIO_B185,         0x400F40B9,__READ_WRITE);
__IO_REG8(     GPIO_B186,         0x400F40BA,__READ_WRITE);

__IO_REG8(     GPIO_B192,         0x400F40C0,__READ_WRITE);
__IO_REG8(     GPIO_B193,         0x400F40C1,__READ_WRITE);
__IO_REG8(     GPIO_B194,         0x400F40C2,__READ_WRITE);
__IO_REG8(     GPIO_B195,         0x400F40C3,__READ_WRITE);
__IO_REG8(     GPIO_B196,         0x400F40C4,__READ_WRITE);
__IO_REG8(     GPIO_B197,         0x400F40C5,__READ_WRITE);
__IO_REG8(     GPIO_B198,         0x400F40C6,__READ_WRITE);
__IO_REG8(     GPIO_B199,         0x400F40C7,__READ_WRITE);
__IO_REG8(     GPIO_B200,         0x400F40C8,__READ_WRITE);
__IO_REG8(     GPIO_B201,         0x400F40C9,__READ_WRITE);
__IO_REG8(     GPIO_B202,         0x400F40CA,__READ_WRITE);
__IO_REG8(     GPIO_B203,         0x400F40CB,__READ_WRITE);
__IO_REG8(     GPIO_B204,         0x400F40CC,__READ_WRITE);
__IO_REG8(     GPIO_B205,         0x400F40CD,__READ_WRITE);
__IO_REG8(     GPIO_B206,         0x400F40CE,__READ_WRITE);
__IO_REG8(     GPIO_B207,         0x400F40CF,__READ_WRITE);
__IO_REG8(     GPIO_B208,         0x400F40D0,__READ_WRITE);
__IO_REG8(     GPIO_B209,         0x400F40D1,__READ_WRITE);
__IO_REG8(     GPIO_B210,         0x400F40D2,__READ_WRITE);
__IO_REG8(     GPIO_B211,         0x400F40D3,__READ_WRITE);
__IO_REG8(     GPIO_B212,         0x400F40D4,__READ_WRITE);
__IO_REG8(     GPIO_B213,         0x400F40D5,__READ_WRITE);
__IO_REG8(     GPIO_B214,         0x400F40D6,__READ_WRITE);
__IO_REG8(     GPIO_B215,         0x400F40D7,__READ_WRITE);
__IO_REG8(     GPIO_B216,         0x400F40D8,__READ_WRITE);
__IO_REG8(     GPIO_B217,         0x400F40D9,__READ_WRITE);
__IO_REG8(     GPIO_B218,         0x400F40DA,__READ_WRITE);
__IO_REG8(     GPIO_B219,         0x400F40DB,__READ_WRITE);
__IO_REG8(     GPIO_B220,         0x400F40Dc,__READ_WRITE);
__IO_REG8(     GPIO_B221,         0x400F40DD,__READ_WRITE);
__IO_REG8(     GPIO_B222,         0x400F40DE,__READ_WRITE);

__IO_REG8(     GPIO_B224,         0x400F40E0,__READ_WRITE);
__IO_REG8(     GPIO_B225,         0x400F40E1,__READ_WRITE);
__IO_REG8(     GPIO_B226,         0x400F40E2,__READ_WRITE);
__IO_REG8(     GPIO_B227,         0x400F40E3,__READ_WRITE);
__IO_REG8(     GPIO_B228,         0x400F40E4,__READ_WRITE);
__IO_REG8(     GPIO_B229,         0x400F40E5,__READ_WRITE);
__IO_REG8(     GPIO_B230,         0x400F40E6,__READ_WRITE);
__IO_REG8(     GPIO_B231,         0x400F40E7,__READ_WRITE);
__IO_REG8(     GPIO_B232,         0x400F40E8,__READ_WRITE);
__IO_REG8(     GPIO_B233,         0x400F40E9,__READ_WRITE);
__IO_REG8(     GPIO_B234,         0x400F40EA,__READ_WRITE);
__IO_REG8(     GPIO_B235,         0x400F40EB,__READ_WRITE);
__IO_REG8(     GPIO_B236,         0x400F40EC,__READ_WRITE);
__IO_REG8(     GPIO_B237,         0x400F40ED,__READ_WRITE);
__IO_REG8(     GPIO_B238,         0x400F40EE,__READ_WRITE);
__IO_REG8(     GPIO_B239,         0x400F40EF,__READ_WRITE);
__IO_REG8(     GPIO_B240,         0x400F40F0,__READ_WRITE);
__IO_REG8(     GPIO_B241,         0x400F40F1,__READ_WRITE);
__IO_REG8(     GPIO_B242,         0x400F40F2,__READ_WRITE);
__IO_REG8(     GPIO_B243,         0x400F40F3,__READ_WRITE);
__IO_REG8(     GPIO_B244,         0x400F40F4,__READ_WRITE);
__IO_REG8(     GPIO_B245,         0x400F40F5,__READ_WRITE);
__IO_REG8(     GPIO_B246,         0x400F40F6,__READ_WRITE);
__IO_REG8(     GPIO_B247,         0x400F40F7,__READ_WRITE);
__IO_REG8(     GPIO_B248,         0x400F40F8,__READ_WRITE);
__IO_REG8(     GPIO_B249,         0x400F40F9,__READ_WRITE);


__IO_REG32(    GPIO_W0,           0x400F5000,__READ_WRITE);
__IO_REG32(    GPIO_W1,           0x400F5004,__READ_WRITE);
__IO_REG32(    GPIO_W2,           0x400F5008,__READ_WRITE);
__IO_REG32(    GPIO_W3,           0x400F500C,__READ_WRITE);
__IO_REG32(    GPIO_W4,           0x400F5010,__READ_WRITE);
__IO_REG32(    GPIO_W5,           0x400F5014,__READ_WRITE);
__IO_REG32(    GPIO_W6,           0x400F5018,__READ_WRITE);
__IO_REG32(    GPIO_W7,           0x400F501C,__READ_WRITE);
__IO_REG32(    GPIO_W8,           0x400F5020,__READ_WRITE);
__IO_REG32(    GPIO_W9,           0x400F5024,__READ_WRITE);
__IO_REG32(    GPIO_W10,          0x400F5028,__READ_WRITE);
__IO_REG32(    GPIO_W11,          0x400F502C,__READ_WRITE);
__IO_REG32(    GPIO_W12,          0x400F5030,__READ_WRITE);
__IO_REG32(    GPIO_W13,          0x400F5034,__READ_WRITE);
__IO_REG32(    GPIO_W14,          0x400F5038,__READ_WRITE);
__IO_REG32(    GPIO_W15,          0x400F503C,__READ_WRITE);

