una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4350_m4.h
#define PWR_STATE_DEEP_SLEEP      0x003000AA
#define PWR_STATE_POWER_DOWN      0x0030FCBA
#define PWR_STATE_DEEP_POWER_DOWN 0x003FFF7F

#endif    /* __IOLPC4350_M4_H */

/*###DDF-INTERRUPT-BEGIN###
Interrupt0   = NMI            0x08
Interrupt1   = HardFault      0x0C
Interrupt2   = MemManage      0x10
Interrupt3   = BusFault       0x14
Interrupt4   = UsageFault     0x18
Interrupt5   = SVC            0x2C
Interrupt6   = DebugMon       0x30
Interrupt7   = PendSV         0x38
Interrupt8   = SysTick        0x3C
Interrupt9   = DAC            0x40
Interrupt10  = M0CORE         0x44
Interrupt11  = DMA            0x48
Interrupt12  = ETHERNET       0x54
Interrupt13  = SDIO           0x58
Interrupt14  = LCD            0x5C
Interrupt15  = USB0           0x60
Interrupt16  = USB1           0x64
Interrupt17  = SCT            0x68
Interrupt18  = RITIMER        0x6C
Interrupt19  = TIMER0         0x70
Interrupt20  = TIMER1         0x74
Interrupt21  = TIMER2         0x78
Interrupt22  = TIMER3         0x7C
Interrupt23  = MCPWM          0x80
Interrupt24  = ADC0           0x84
Interrupt25  = I2C0           0x88
Interrupt26  = I2C1           0x8C
Interrupt27  = SPI            0x90
Interrupt28  = ADC1           0x94
Interrupt29  = SSP0           0x98
Interrupt30  = SSP1           0x9C
Interrupt31  = USART0         0xA0
Interrupt32  = UART1          0xA4
Interrupt33  = USART2         0xA8
Interrupt34  = USART3         0xAC
Interrupt35  = I2S0           0xB0
Interrupt36  = I2S1           0xB4
Interrupt37  = SPIFI          0xB8
Interrupt38  = SGPIO          0xBC
Interrupt39  = PIN_INT0       0xC0
Interrupt40  = PIN_INT1       0xC4
Interrupt41  = PIN_INT2       0xC8
Interrupt42  = PIN_INT3       0xCC
Interrupt43  = PIN_INT4       0xD0
Interrupt44  = PIN_INT5       0xD4
Interrupt45  = PIN_INT6       0xD8
Interrupt46  = PIN_INT7       0xDC
Interrupt47  = GINT0          0xE0
Interrupt48  = GINT1          0xE4
Interrupt49  = EVENTROUTER    0xE8
Interrupt50  = C_CAN1         0xEC
Interrupt51  = ATIMER         0xF8
Interrupt52  = RTC            0xFC
Interrupt53  = WWDT           0x104
Interrupt54  = C_CAN0         0x10C
Interrupt55  = QEI            0x110
###DDF-INTERRUPT-END###*/
